## Блоки подменяемых почт
<br>
<br>
<IframeVideo src="https://www.youtube.com/embed/_4AkBVkwnnQ">
<img src="Email_tracking_png.png" alt="" width="100%" height="180px"/>
</IframeVideo>
<br>
Блок определяет место подменяемой почты на вашем сайте и является обязательным элементом для настройки Емейлтрекинга. Вы можете добавить несколько блоков, если это необходимо. 
<br>

## Создание блока
<br>
Для создания блока вам необходимо указать его название, например «Контактная почта» и выбрать сайт, на котором почта будет заменяться.
Можно выбрать сразу несколько сайтов для одного блока. Это удобно, если все сайты используют одну почту или почты заданы через один атрибут. Подмена почт будет работать одинаково для всех сайтов.
<br>
Теперь «объясните» сервису, где на сайте находится почта для подмены. Простой способ: выберите «Найти в коде» и введите электронную почту. Таким образом, вы укажете сервису, где находится почта для подмены.
<br><br>
<Alert>Другой способ — найти в HTML-коде элементы с определенными атрибутами (id, class и др.). Например, разные почты на сайте могут иметь один класс — email. Указав этот класс, вы сможете подменять все почты.
<br></Alert><br>

## Расширенные настройки
<br>
Здесь можно задать дополнительные условия внутри блока. Это полезно, если сайт использует разные почты, и вы хотите заменить их, не изменяя атрибуты.
<br>
